#!/usr/bin/python
# coding=utf-8

# Метчер смайлов в тексте
# Возращает все смайлы и спец символы найденные в тексте
# * Корректно обрабатывает репититивные формы 
# * Находит простые азиатские смайлы
# * Эмодзи
# * возращает тональную оценку смайла

import re

_smiles = [
   [ 0.5, r"[:;=]-*[PpРр]+", r"[РрPp]"], # :P
   [ 1.0, r"[:;=]-*\)+"    , r"\)"    ], # :)
   [ 1.0, r"\){2,}"        , r"\)"    ], # ))
   [ 1.0, r"[:;=]-*[3зЗ]+" , r"[3Зз]" ], # :3
   [ 1.0, r"(<|&lt\;)[3З]+", r"[3З]"  ], # <3
   [ 1.5, r"[xXхХ]-*\)+"   , r"\)"    ], # X)
   [ 1.5, r"[:;=]-*\*+"    , r"\*"    ], # :*
   [ 2.0, r"[:;=xXхХ]-*D+" , r"D"     ], # :D
   
   [-1.0, r"[:;=]-*\(+"    , r"\("    ], # :(
   [-1.0, r"\({2,}"        , r"\("    ], # ((
   [-1.5, r"[xXхХ]-*\(+"   , r"\("    ], # X(
   [-2.0, r"[:;=]-*[CСcс]+", r"[CСcс]"], # :C

   [ 1.0, r"\^_*\^"            , r"_" ], # ^_^
   [ 0.5, r"[OoОо0]_+[OoОо0]"  , r"_" ], # о_О
   [ 1.5, r"\*_*\*"            , r"_" ], # *_*
   [ 2.0, r"(&gt;|>)_+(&lt;|<)", r"_" ], # >_<
   [-1.0, r"[тТT]_+[тТT]"      , r"_" ], # Т_Т
]

# _emoji_match = r"[\u2600-\u26FF\u2700-\u27BF\uE000-\uF8FF]|\uD83C[\uDF00-\uDFFF]|\uD83D[\uDC00-\uDDFF]|\uD83D[\uDE00-\uDE4E]"
_emoji_match = u'[\U0001F300-\U0001F5FF\U0001F600-\U0001F64F\U0001F680-\U0001F6FF\u2600-\u26FF\u2700-\u27BF]'

# http://unicode.org/emoji/charts/full-emoji-list.html
_emoji_tone = [
    # smiles
    [ 2.0, u"😀😬😁😂😃😄😅😆😍"],
    [ 1.0, u"😇😉😊🙂🙃☺️😋😌😘😗😙😚😜😝😛🤑🤓😎🤗😈"],
    [ 0.5, u"😏😶😐😴😑🙄🤔"],
    [-1.0, u"😳😞😟😔😕😒🙁☹️😯👿🤐😷🤒🤕"],
    [-2.0, u"😠😡😣😖😫😩😤😮😱😨😰😦😧😢😥😪😓😭😵😲"],
    # Skin emoji
    [ 1.5, u"💆🏻💇🏻👰🏻🙍🏻🙎🏻🙅🏻🙆🏻💁🏻🙋🏻🙇🏻🙌🏻🙏🏻🚶🏻🏃🏻💃🏻💆🏼💇🏼👰🏼🙍🏼🙎🏼🙅🏼🙆🏼💁🏼🙋🏼🙇🏼🙌🏼🙏🏼🚶🏼🏃🏼💃🏼💆🏽💇🏽👰🏽🙍🏽🙎🏽🙅🏽🙆🏽💁🏽🙋🏽🙇🏽🙌🏽🙏🏽🚶🏽🏃🏽💃🏽💆🏾💇🏾👰🏾🙍🏾🙎🏾🙅🏾🙆🏾💁🏾🙋🏾🙇🏾🙌🏾🙏🏾🚶🏾🏃🏾💃🏾💆🏿💇🏿👰🏿🙍🏿🙎🏿🙅🏿🙆🏿💁🏿🙋🏿🙇🏿🙌🏿🙏🏿🚶🏿🏃🏿💃🏿"],
    [ 1.0, u"👦🏻👧🏻👨🏻👩🏻👴🏻👵🏻👶🏻👱🏻👮🏻👲🏻👳🏻👷🏻👸🏻💂🏻🎅🏻👼🏻👦🏼👧🏼👨🏼👩🏼👴🏼👵🏼👶🏼👱🏼👮🏼👲🏼👳🏼👷🏼👸🏼💂🏼🎅🏼👼🏼👦🏽👧🏽👨🏽👩🏽👴🏽👵🏽👶🏽👱🏽👮🏽👲🏽👳🏽👷🏽👸🏽💂🏽🎅🏽👼🏽👦🏾👧🏾👨🏾👩🏾👴🏾👵🏾👶🏾👱🏾👮🏾👲🏾👳🏾👷🏾👸🏾💂🏾🎅🏾👼🏾👦🏿👧🏿👨🏿👩🏿👴🏿👵🏿👶🏿👱🏿👮🏿👲🏿👳🏿👷🏿👸🏿💂🏿🎅🏿👼🏿"],
    [ 1.0, u"🚣🏻🛀🏻🏄🏻🏇🏻🏊🏻⛹🏻🏋🏻🚴🏻🚵🏻🚣🏼🛀🏼🏄🏼🏇🏼🏊🏼⛹🏼🏋🏼🚴🏼🚵🏼🚣🏽🛀🏽🏄🏽🏇🏽🏊🏽⛹🏽🏋🏽🚴🏽🚵🏽🚣🏾🛀🏾🏄🏾🏇🏾🏊🏾⛹🏾🏋🏾🚴🏾🚵🏾🚣🏿🛀🏿🏄🏿🏇🏿🏊🏿⛹🏿🏋🏿🚴🏿🚵🏿"],
    [ 1.0, u"💪🏻👈🏻👉🏻☝🏻️👆🏻🖕🏻👇🏻✌🏻🖖🏻🤘🏻🖐🏻✊🏻✋🏻👌🏻👍🏻👋🏻👏🏻👐🏻✍🏻💅🏻👂🏻👃🏻💪🏼👈🏼👉🏼☝🏼️👆🏼🖕🏼👇🏼✌🏼🖖🏼🤘🏼🖐🏼✊🏼✋🏼👌🏼👍🏼👋🏼👏🏼👐🏼✍🏼💅🏼👂🏼👃🏼💪🏽👈🏽👉🏽☝🏽️👆🏽🖕🏽👇🏽✌🏽🖖🏽🤘🏽🖐🏽✊🏽✋🏽👌🏽👍🏽👋🏽👏🏽👐🏽✍🏽💅🏽👂🏽👃🏽💪🏾👈🏾👉🏾☝🏾️👆🏾🖕🏾👇🏾✌🏾🖖🏾🤘🏾🖐🏾✊🏾✋🏾👌🏾👍🏾👋🏾👏🏾👐🏾✍🏾💅🏾👂🏾👃🏾💪🏿👈🏿👉🏿☝🏿️👆🏿🖕🏿👇🏿✌🏿🖖🏿🤘🏿🖐🏿✊🏿✋🏿👌🏿👍🏿👋🏿👏🏿👐🏿✍🏿💅🏿👂🏿👃🏿"],
    [-1.0, u"👊🏻👎🏻👊🏼👎🏼👊🏽👎🏽👊🏾👎🏾👊🏿👎🏿"],
    # Animals
    [ 1.0, u"🐶🐱🐭🐹🐰🐻🐼🐨🐯🦁🐮🐷🐽🐸🐙🐵🙈🙉🙊🐒🐔🐧🐦🐤🐣🐥🐺🐗🐴🦄🐝🐛🐌🐞🐜🕷🦂🦀🐍🐢🐠🐟🐡🐬🐳🐋🐊🐆🐅🐃🐂🐄🐪🐫🐘🐐🐏🐑🐎🐖🐀🐁🐓🦃🕊🐕🐩🐈🐇🐿🐾🐉🐲🌵🎄🌲🌳🌴🌱🌿☘🍀🎍🎋🍃🍂🍁🌾🌺🌻🌹🌷🌼🌸💐🍄🌰🎃🐚🕸🌎🌍🌏🌕🌖🌗🌘🌑🌒🌓🌔🌚🌝🌛🌜🌞🌙⭐️🌟💫✨☄☀️🌤⛅️🌥🌦☁️🌧⛈🌩⚡️🔥💥❄️🌨🔥💥❄️🌨☃⛄️🌬💨🌪🌫☂☔️💧💦🌊"],
    # food & drinks
    [ 1.0, u"🍏🍎🍐🍊🍋🍌🍉🍇🍓🍈🍒🍑🍍🍅🍆🌶🌽🍠🍯🍞🧀🍗🍖🍤🍳🍔🍟🌭🍕🍝🌮🌯🍜🍲🍥🍣🍱🍛🍙🍚🍘🍢🍡🍧🍨🍦🍰🎂🍮🍬🍭🍫🍿🍩🍪🍺🍻🍷🍸🍹🍾🍶🍵☕️🍼🍴🍽"],
    # Activity and Sports
    [ 1.0, u"⚽️🏀🏈⚾️🎾🏐🏉🎱⛳️🏌🏓🏸🏒🏑🏏🎿⛷🏂⛸🏹🎣🚣🏊🏄🛀⛹🏋🚴🚵🏇🕴🏆🎽🏅🎖🎗🏵🎫🎟🎭🎨🎪🎤🎧🎼🎹🎷🎺🎸🎻🎬🎮👾🎯🎲🎰🎳"], 
    # Travel & Places
    [ 1.0, u"🚗🚕🚙🚌🚎🏎🚓🚑🚒🚐🚚🚛🚜🏍🚲🚨🚔🚍🚘🚖🚡🚠🚟🚃🚋🚝🚄🚅🚈🚞🚂🚆🚇🚊🚉🚁🛩✈️🛫🛬⛵️🛥🚤⛴🛳🚀🛰💺⚓️🚧⛽️🚏🚦🚥🏁🚢🎡🎢🎠🏗🌁🗼🏭⛲️🎑⛰🏔🗻🌋🗾🏕⛺️🏞🛣🛤🌅🌄🏜🏖🏝🌇🌆🏙🌃🌉🌌🌠🎇🎆🌈🏘🏰🏯🏟🗽🏠🏡🏚🏢🏬🏣🏤🏥🏦🏨🏪🏫🏩💒🏛⛪️🕌🕍🕋⛩"],
    # Objects
    [ 2.0, u"🎊🎉"],
    [ 1.0, u"💎"],
    [ 0.5, u"⌚️📱📲💻⌨🖥🖨🖱🖲🕹🗜💽💾💿📀📼📷📸📹🎥📽🎞📞☎️📟📠📺📻🎙🎚🎛⏱⏲⏰🕰⏳⌛️📡🔋🔌💡🔦🕯🗑🛢💸💵💴💶💷💰💳⚖🔧🔨⚒🛠⛏🔩⚙⛓🔫💣🔪🗡⚔🛡🚬☠⚰⚱🏺🔮📿💈⚗🔭🔬🕳💊💉🌡🏷🔖🚽🚿🛁🔑🗝🛋🛌🛏🚪🛎🖼🗺⛱🗿🛍🎈🎏🎀🎁🎎🎐🎌🏮✉️📩📨📧💌📮📪📫📬📭📦📯📥📤📜📃📑📊📈📉📄📅📆🗓📇🗃🗳🗄📋🗒📁📂🗂🗞📰📓📕📗📘📙📔📒📚📖🔗📎🖇✂️📐📏📌📍🚩🏳🏴🔐🔒🔓🔏🖊🖊🖋✒️📝✏️🖍🖌🔍🔎"],
    # Symbols    
    [ 1.5, u"❤️💛💙💜❣💕💞💓💗💖💘💝💟♥️🔅🔆💯"],
    [ 0.5, u"☮✝☪🕉☸✡🔯🕎☯☦🛐⛎♈️♉️♊️♋️♌️♍️♎️♏️♐️♑️♒️♓️🆔⚛🈳🈹☢☣📴📳🈶🈚️🈸🈺🈷✴️🆚🉑💮🉐㊙️㊗️🈴🈵🈲🅰🅱🆎🆑🅾🆘♨️🔱⚜〽️⚠️🚸🔰♻️🈯️💹❇️✳️❎✅💠🌀➿🌐Ⓜ️🏧🈂🛂🛃🛄🛅♿️🚭🚾🅿️🚰🚹🚺🚼🚻🚮🎦📶🈁🆖🆗🆙🆒🆕🆓0⃣1⃣2⃣3⃣4⃣5⃣6⃣7⃣8⃣9⃣🔟🔢▶️⏸⏯⏹⏺⏭⏮⏩⏪🔀🔁🔂◀️🔼🔽⏫⏬➡️⬅️⬆️⬇️↗️↘️↙️↖️↕️↔️🔄↪️↩️⤴️⤵️#⃣*⃣ℹ️🔤🔡🔠🔣🎵🎶〰➰✔️🔃➕➖➗✖️💲💱©®™🔚🔙🔛🔝🔜☑️🔘⚪️⚫️🔴🔵🔸🔹🔶🔷🔺▪️▫️⬛️⬜️🔻◼️◻️◾️◽️🔲🔳🔈🔉🔊🔇📣📢🔔🔕🃏🀄️♠️♣️♦️🎴👁‍🗨💭🗯💬🕐🕑🕒🕓🕔🕕🕖🕗🕘🕙🕚🕛🕜🕝🕞🕟🕠🕡🕢🕣🕤🕥🕦🕧❕❔"],
    [-1.0, u"⛔️📛🚫❌⭕️💢🚷🚯🚳🚱🔞📵❗️❓‼️⁉️"],
    [-2.0, u"💔"],
]

# build emoji index
_emoji = None
def _init_emoji():
    global _emoji
    _emoji = {}
    for t in _emoji_tone:
        for e in t[1]:
            _emoji[e] = t[0]

def _count(pattern, string): 
    return len(re.findall(pattern, string))

def resmile(string):
    tone = 0
    for r in _smiles:
        match = re.findall(r[1], string)
        if match != None:
            for m in match:
                t = r[0] * _count(r[2], m)
                tone += t
                string = string.replace(m,'',1)

    if _emoji == None:
        _init_emoji()

    match = re.findall(re.compile(_emoji_match, re.UNICODE), string)
    if match != None:
        for m in match:
            t = _emoji.get(m, 0)
            tone += t
            string = string.replace(m,'',1)
            if t is 0:
                print(t)

    return (string, tone)

if __name__ == "__main__":

    import io
    import sys
    
    # stdin = codecs.getreader("utf-8")(sys.stdin)
    stdin = io.TextIOWrapper(sys.stdin.buffer, encoding='utf-8')
    for l in stdin:
        print(resmile(l))    
        
